Repository: LukaszLejman/PJN
Catalog: manuals/1/align_2017.12.08_13.27.55/RS800CX-HRRS800CX.tmx
Source language: en
Languages: hr

source: Select Settings > General > Language > English / Deutsch / Español / Français / Italian
hr: Jezik Odabir jezika Odaberite Settings > General > Language > English / Deutsch / Español / Français / Italian

source: Sleep Activate the sleep function Select Settings > General > Sleep > Activate sleep mode? > Yes Activating the sleep mode will help save the battery when the training computer is out of use for a long period of time.
hr: Hibernacija Aktiviranje funkcije hibernacije Odaberite Settings > General > Sleep > Activate sleep mode? > Yes Aktiviranje režima hibernacije će pomoći u štednji baterije kada se monitor srčane frekvencije ne koristi na duže razdoblje.

source: The watch alarm will still function in sleep mode.
hr: U ovom režimu, alarm sata će još uvijek funkcionirati.

source: Awaken the training computer Press any button > Turn display on? > Yes / No • Yes: the training computer is activated. • No: the training computer returns to sleep mode.
hr: Za buđenje monitora srčane frekvencije Pritisnite bilo koju tipku > Turn display on? > Yes / No (upali zaslon?) • Yes: monitor srčane frekvencije je aktiviran. • No: monitor srčane frekvencije se vraća u režim hibernacije.

source: Watch Settings
hr: Postavke sata

source: Select Settings > Watch > Reminders > Add new • Date: Enter the date of the task, dd=day, mm=month, yy=year. • Reminder time : Enter the time for the task. • Alarm: Set alarm to sound on time, or 10 min / 30 min / 1 hour before the task.
hr: Podsjetnik Postavite podsjetnik za različite zadatke ili vježbe Odaberite Settings > Watch > Reminders > Add new POSTAVKE

source: Settings 39
hr: 39 HRVATSKI, SRPSKI

source: • Sound: Select alarm sound Silent / Beep / Normal. • Repeat : Select reminder to repeat Once / Hourly / Daily / Weekly / Monthly / Yearly. • Exercise : Select an exercise to link to the reminder.
hr: Alarm: Postavite alarm da se oglasi na vrijeme, ili 10 min/30 min/1 sat prije zadatka. Sound: Odaberite glasnoću alarma Silent / Beep / Normal (tih/kratki zvuk/normalno).

source: When the reminder goes off, the training computer will present this exercise as default.
hr: Repeat : Odaberite ponavljanje podsjetnika Once/Hourly/Daily/Weekly/Monthly/Yearly (jednom/svaki •

source: Select NONE if you do not want to link the reminder to an exercise session. • Rename: To rename the reminder, select letters with UP or DOWN, and accept with OK.
hr: Exercise : Odaberite vježbu koju će te povezati s podsjetnikom. Kada se podsjetnik oglasi, monitor srčane frekvencije će postaviti ovu vježbu kao standardnu.

source: You can program seven reminders in the training computer.
hr: Odaberite NONE ako ne želite povezati podsjetnik s vježbom.

source: See active reminders and modify them
hr: U monitoru srčane frekvencije možete programirati sedam podsjetnika.

source: Select Settings > Watch > Reminders Select a reminder to view, edit, rename or delete.
hr: Za pregled aktivnih podsjetnika i njihovo namještanje: Odaberite Settings > Watch > Reminders Odaberite određeni podsjetnik za pregled, namještanje, promjenu naziva ili brisanje.

source: Event Set an event countdown in the training computer Select Settings > Watch > Event Event day: dd=day, mm=month.
hr: Događaj Za postavljanje odbrojavanje do događaja u monitor srčane frekvencije Odaberite Settings > Watch > Event Event day: Datum događaja. dd=dan, mm=mjesec.

source: Rename: To rename the event, select letters with UP or DOWN, and accept with OK.
hr: Rename: Za promjenu naziva događaja, odaberite slova s GORE ili DOLJE i prihvatite s OK.

source: Modify the event countdown
hr: Za promjenu odbrojavanja do događaja.

source: Select Settings > Watch > Event You can view the event countdown, set a new date, rename or delete it.
hr: Odaberite Settings > Watch > Event Možete pregledati odbrojavanje do događaja, postaviti novi datum, promijeniti mu naziv ili ga izbrisati.

source: In time mode, hide or view the event countdown again by pressing and holding UP. Alarm Set an alarm on your training computer
hr: U vremenskom režimu, sakrijte ili ponovo pregledajte odbrojavanje do događaja pritiskom i držanjem tipke GORE.

source: Select Settings > Watch > Alarm > Off / Once / Mon-Fri / Daily
hr: Alarm Postavljanje alarma u vašem monitoru srčane frekvencije Odaberite Settings > Watch > Alarm > Off / Once / Mon-Fri / Daily Alarm možete postaviti da se aktivira jednom (Once), svaki dan između ponedjeljka i petka (Mon-Fri), ili dnevno (Daily).

source: You can set the alarm to go off once everyday between Monday and Friday, or daily.
hr: Alarm se oglašava u svim režimima rada osim u režimu vježbanja, i to će činiti jednu minutu ako ne pritisnete STOP.

source: The alarm sounds in all modes except in exercise mode, and will do so for a minute unless you press STOP.
hr: Alarm sata također funkcionira u hibernaciji i čak ako ste zvuk ugasili u općenitim postavkama.

source: To snooze the alarm an extra 10 minutes, press UP or DOWN buttons or OK: Snooze is displayed and the snooze time starts counting.
hr: Za odgađanje alarma dodatnih 10 minuta, pritisnite tipke GORE, DOLJE ili OK.

source: If a battery symbol appears in the display, the alarm cannot be activated.
hr: Prikaže se Snooze i počinje odbrojavanje produženog vremena alarma.

source: Time Set time 1 in the training computer Select Settings > Watch > Time 1 > 24h / 12h
hr: Za izlazak iz produženog alarma, pritisnite STOP.

source: Set time 2 in the training computer Select Settings > Watch > Time 2
hr: Ako se na zaslonu pojavi simbol baterije, alarm se ne može aktivirati.

source: Switch between time zones Select Settings > Watch > Time zone > Time 1 / Time 2
hr: Vrijeme U monitoru srčane frekvencije postavite vrijeme 1 Odaberite Settings > Watch > Time 1 > 24h / 12h U monitoru srčane frekvencije postavite vrijeme 2 Odaberite Settings > Watch > Time 2

source: 40 Settings
hr: 40 POSTAVKE

source: Select a time zone
hr: HRVATSKI, SRPSKI

source: In time mode, change the time zone by pressing and holding DOWN.
hr: Postavite željenu vremensku razliku između vremena 1 i vremena 2 u satima pomoću tipki GORE/DOLJE.

source: Number 2 on the lower right corner of the display indicates that Time 2 is in use.
hr: Prebacivanje između vremenskih zona Odaberite Settings > Watch > Time zone > Time 1 / Time 2 Odabir vremenske zone U vremenskom režimu, promijenite vremensku zonu pritiskom i držanjem tipke DOLJE.

source: Date Set the date in the training computer
hr: Broj 2 u donjem desnom kutu zaslona označava da se koristi Vrijeme 2.

source: Select Settings > Watch > Date dd=day, mm=month, yy=year
hr: Datum Namještanje datuma u monitoru srčane frekvencije Odaberite Settings > Watch > Date dd=dan, mm=mjesec, yy=godina

source: Shortcut Button (Quick Menu) Some settings can be changed with a shortcut button in time mode.
hr: Tipka prečaca (brzi izbornik) Neke postavke se mogu mijenjati s tipkom prečaca u vremenskom režimu.

source: Press and hold LIGHT > Quick menu • Keylock • Reminders • Alarm • Time zone • Sleep
hr: Pritisnite i držite SVJETLO > Quick menu • Keylock – Blokiranje tipki • Reminders – Podsjetnici • Alarm • Time zone – Vremenska zona • Sleep – Hibernacija POSTAVKE

source: Settings 41 ENGLISH
hr: 41 HRVATSKI, SRPSKI

source: 8. TRAINING PROGRAM View Program You can create and download a personalized training program to your training computer by using Polar ProTrainer 5.
hr: 8. PROGRAM VJEŽBANJA Pregled programa Koristeći Polar ProTrainer 5 stvorite i prebacite vama prilagođeni program vježbanja u monitor srčane frekvencije.

source: This chapter includes the basic instructions on how to navigate and manage the program once you have downloaded it to your training computer.
hr: Ovo poglavlje uključuje osnovne upute kako pregledavati i upravljati programom kada ga prebacite u vaš monitor srčane frekvencije.

source: For further information on creating programmed exercises with the software, transferring them to your training computer, and analyzing your performance after training, see Polar ProTrainer 5 help.
hr: Za dodatne informacije o stvaranju programiranih vježbi s ovim softverom, prebacivanjem u monitor srčane frekvencije i analizu vaših performansi nakon vježbanja, pogledajte upute softvera Polar ProTrainer 5.

source: After downloading the program, two special menus are created in your training computer where you can view your program and check your daily schedule.
hr: Nakon skidanja programa za vježbanje, u vašem monitoru srčane frekvencije su prikazana dva dodatna izbornika, u kojima možete pregledati vaš program i provjeriti vaš dnevni raspored.

source: Scroll weeks, days, and exercises with UP or DOWN.
hr: Pomičite se kroz tjedne, dane i vježbe s tipkama GORE i DOLJE.

source: Select week and day with OK.
hr: Tjedan i dan odaberite s OK.

source: View your weekly program Select Program > Week view The week view offers an overview of your weekly exercises.
hr: Pregled vašeg tjednog programa Odaberite Program > Week view Tjedni pregled nudi pregled vaših tjednih vježbi.

source: The white bar represents planned exercise time and the black bar represents performed exercise time.
hr: Bijeli stupac predstavlja planirano vrijeme vježbanja, a crni stupac predstavlja obavljeno vrijeme vježbanja.

source: Weekly target exercise time is shown below the bars.
hr: Ispod stupaca prikazano je tjedno ciljano vrijeme vježbanja.

source: Press and hold LIGHT to view the following information on the week: • Week info: Week name and description. • Targets: Summary of targets for the week.
hr: Pritisnite i držite tipku SVJETLO za pregled slijedećih informacija u svezi tjedna: • Week info: Naziv i opis tjedna. • Targets: Sažetak ciljeva za ovaj tjedan.

source: Calories, distance* and duration.
hr: Kalorije, udaljenost* i trajanje.

source: Planned time for sport zones: press OK and scroll between sport zones with UP or DOWN. • Results: Summary of results for the week.
hr: Planirano vrijeme za sportske zone: pritisnite OK i prebacujte se između sportskih zona s GORE ili DOLJE. • Results: Sažetak tjednih rezultata.

source: Performed time in sport zones: press OK and scroll between sport zones with UP or DOWN. • Reminder : Set alarm (on time, 10 min, 30 min or 1 hour before the exercise) and define sound type (Silent, Beep, Normal). • Program off : Remove the program from your training computer.
hr: Planirano vrijeme za sportske zone: pritisnite OK i prebacujte se između sportskih zona s GORE ili DOLJE. • Reminder : Postavite alarm (na vrijeme; 10 min, 30 min ili 1 sat prije vježbe) i definirajte vrstu zvuka (Silent, Beep, Normal). • Program off : Uklonite program iz vašeg monitora srčane frekvencije.

source: View your daily program Select Program > Week view > Day view Select Today > Exercise view The day view offers an overview of your daily exercises.
hr: Za pregled vašeg dnevnog programa Odaberite Program > Week view > Day view Odaberite Today > Exercise view Dnevni pregled nudi pregled vaših dnevnih vježbi.

source: Daily target exercise time is shown below the bars.
hr: Ispod stupaca prikazano je dnevno ciljano vrijeme vježbanja.

source: Press and hold LIGHT to view additional information on the day: • Targets: Summary of targets for the day.
hr: Pritisnite i držite tipku SVJETLO za pregled slijedećih informacija u svezi dana: • Targets: Sažetak ciljeva za ovaj dan.

source: Calories, distance,* and duration.
hr: Kalorije, udaljenost* i trajanje.

source: Planned time for sport zones: press OK and scroll between sport zones with UP or DOWN. • Results: Summary of results for the day.
hr: Planirano vrijeme za sportske zone: pritisnite OK i prebacujte se između sportskih zona s GORE ili DOLJE. • Results: Sažetak dnevnih rezultata.

source: Performed time in sport zones: press OK and scroll between sport zones with UP or DOWN. View your daily exercise
hr: Planirano vrijeme za sportske zone: pritisnite OK i prebacujte se između sportskih zona s GORE ili DOLJE.

source: 42 Training Program
hr: 42 PROGRAM VJEŽBANJA

source: Select Program > Week view > Day view > Exercise view The exercise view shows the following information: exercise name, description, and target duration.
hr: Pregled vaše dnevne vježbe Odaberite Program > Week view > Day view > Exercise view Pregled vježbe prikazuje slijedeće informacije: naziv vježbe, opis i ciljano trajanje.

source: Press and hold LIGHT to view following information: • Targets: Summary of targets for the training session.
hr: Pritisnite i držite tipku SVJETLO za pregled slijedećih informacija: • Targets: Sažetak ciljeva za ciklus vježbanja.

source: Planned time for sport zones: press OK and scroll between sport zones with UP or DOWN. • Phases: Summary of phases for the training session. • Sport profile: View the name of chosen sport profile.
hr: Planirano vrijeme za sportske zone: pritisnite OK i prebacujte se između sportskih zona s GORE ili DOLJE. • Phases: Sažetak faza ciklusa vježbanja. • Sport profile: Naziv odabranog sportskog profila.

source: For further information, see software help. • Reminder : Set the reminder time. *Optional s3/s3+ stride sensor, G3/G5 GPS sensor or cycling speed sensor W.I.N.D. required.
hr: Za dodatne informacije, pogledajte upute softvera. • Reminder : Postavite vrijeme podsjetnika. *Potreban opcijski s3 trkaći senzor, G3 GPS senzor ili biciklistički senzor brzine W.I.N.D.

source: Perform Programmed Exercise Start training If you have set a reminder, your training computer will remind you to train according to plan on the scheduled date.
hr: Provođenje programiranih vježbi Početak vježbanja Ako ste postavili podsjetnik, vaš monitor srčane frekvencije će vas podsjetiti da vježbate u skladu s planom na postavljeni datum.

source: Check the planned exercise information by pressing OK when the reminder has gone off.
hr: Pregledajte informacije o planiranoj vježbi pritiskom na OK kada se podsjetnik ugasi.

source: Start Daily Exercise Select Today > Exercise view > Press OK > Press OK Select Program > Week view > Day view > Exercise view > Press OK > Press OK
hr: Početak dnevne vježbe Odaberite Today > Exercise view > OK > OK Odaberite Program > Week view > Day view > Exercise view > OK > OK Za dodatne informacije o snimanju vježbanja, pogledajte Počnite vježbati (stranica 13).

source: For further information on exercise recording, see Start Training (page 13).
hr: Vaš monitor srčane frekvencije će vas voditi kroz ciklus vježbanja.

source: Exercise with Phases Below is an example of an interval exercise, which is divided into four phases: Warm up / P1: Run 10 minutes at a heart rate between 55-65% of maximum heart rate.
hr: Vježbanja u fazama Dolje je dan primjer intervalne vježbe, koja je podijeljena u četiri faze: Warm up / P1: Trčite 10 minuta s otkucajima srca između 55-65% vašeg maksimalnog broja otkucaja srca.

source: Interval / P2: Run 3 km at a pace between 3:30-4:00 min/km.
hr: Interval / P2: Trčite 3 km s ritmom između 3:30-4:00 min/km.

source: Recovery / P3: After 3 km let your heart rate drop to 120 bpm.
hr: Recovery / P3: Nakon 3 km neka broj otkucaja vašeg srca padne na 120 bpm.

source: Repeat phases 2 and 3 6 times each.
hr: Ponovite faze 2 i 3 šest puta.

source: Cool down / P4: Run 10 minutes at a pace between 5:00-6:00 min/km.
hr: Cool down / P4: Trčite 10 minuta s ritmom između 5:00-6:00 min/km.

source: Views during the exercise During the exercise you will see the following display types:
hr: Prikazi za vrijeme vježbanja Za vrijeme vježbe vidjeti će te slijedeće vrste prikaza:

source: Every phase starts with a display showing: Phase name Zone type Zone limits Number of phase repeats left During exercise the phase display shows: Countdown timer/distance*, countup timer, number of current phase Target zone in graphical format (updated every 10 seconds, showing the last 8 minutes on the display) Heart rate Number of phase repeats left
hr: Svaka faza započinje s prikazom: Naziv faze Vrsta zone Granice zone Broj preostalih ponavljanja faze Za vrijeme vježbe prikaz faze pokazuje: Odbrojavanje vremena/udaljenosti*, brojač vremena, broj trenutne faze Ciljanu zonu u grafičkom formatu (osvježavanje svakih 10 sek., prikazujući zadnjih 8 minuta na zaslonu) Otkucaji srca Broj preostalih ponavljanja faze PROGRAM VJEŽBANJA

source: Training Program 43
hr: 43 HRVATSKI, SRPSKI

source: ENGLISH Every phase ends with a phase-end display showing: Phase duration or distance* Heart rate difference (how much you have increased or decreased your heart rate during the phase) or average speed/pace Average heart rate Number of ended phase After performing the programmed exercise, this display shows that the exercise is completed.
hr: Svaka faza završava s prikazom: Trajanje ili udaljenost* faze Razlika otkucaja srca (koliko ste povećali ili smanjili vaše otkucaje srca za vrijeme ove faze) ili prosječna brzina/ritam Prosječni broj otkucaja srca Broj završenih faza Kada je programirana vježba završena, zaslon prikazuje da je vježba završena.

source: The training computer enters Free exercise mode, and you can continue exercising without settings.
hr: Monitor srčane frekvencije ulazi u režim Free vježbe i možete nastaviti vježbati bez postavki.

source: The exercise is recorded and information is gathered to File until you stop the exercise.
hr: Vježba se sprema i informacije se skupljaju u datoteku dok ne zaustavite vježbu.

source: For further information on how to plan sessions with the software, and then transfer them to your training computer, see software help.
hr: Za dodatne informacije u svezi planiranja ciklusa i prebacivanja na vaš monitor srčane frekvencije sa softverom, pogledajte upute softvera.

source: Functions During Exercise You can change the same settings in a programmed exercise as in any other exercise type.
hr: Funkcije za vrijeme vježbanja Promijenite iste postavke programirane vježbe kao i bilo koje druge vrste vježbe.

source: For further information on different functions during exercise, see Button Functions During Exercise (page 20).
hr: Za dodatne informacije o različitim funkcijama za vrijeme vježbe, pogledajte Funkcije tipki tijekom vježbanja (stranica 20).

source: The programmed exercise uses the sport profile settings set in the software.
hr: Programirana vježba koristi postavke sportskog profila, postavljenih u softveru.

source: If you change the training computer settings during exercise (e.g. calibration factor), the changes will only apply to the current exercise.
hr: Ako za vrijeme vježbanja promijenite postavke monitora srčane frekvencije (npr. faktor kalibracije), promjene će se odnositi samo na trenutnu vježbu.

source: Next time you start the same exercise, the training computer will use the sport profile settings defined in the software.
hr: Slijedeći put kada počnete istu vježbu, monitor srčane frekvencije će koristiti postavke sportskog profila definirane u softveru.

source: Lap Menu To see the lap menu during programmed exercise, press and hold OK.
hr: Izbornik kruga Za pregled izbornika kruga za vrijeme programirane vježbe, pritisnite i držite OK.

source: Scroll between options with UP or DOWN and select with OK.
hr: Pomičite se između opcija s tipkama GORE ili DOLJE, i potvrdite s OK.

source: The contents of the lap menu depend on your exercise. • End phase: End current phase and move to the next phase in the exercise. • Jump to: Move to any other phase in your exercise. • Lock zone or Unlock zone: Lock your heart rate or speed/pace* to a certain sport zone if exercising without preset target zones.
hr: Sadržaj izbornika kruga ovisi o vašoj vježbi. • End phase: završetak trenutne faze i prebacivanje na slijedeću fazu u vježbi. • Jump to: Prebacivanje na bilo koju drugu fazu vaše vježbe. • Lock zone ili Unlock zone: zaključajte otkucaje srca ili brzinu/ritam* prema određenoj sportskoj zoni ako vježbate bez postavljenih ciljanih zona.

source: See Exercise Results Select File > Exercise log After completing a programmed exercise, your training data will be saved under File.
hr: Za pregled rezultata vježbe Odaberite File > Exercise log Nakon završetka programirane vježbe, podaci vašeg vježbanja će biti spremljeni u File.

source: For further information, see Analyze Exercise Results (page 23). *Optional s3/s3+ stride sensor, G3/G5 GPS sensor or cycling speed sensor W.I.N.D. required.
hr: Za dodatne informacije, pogledajte Analiza rezultata vježbanja (stranica 23). *Potreban opcijski s3 trkaći senzor, G3 GPS senzor ili biciklistički senzor brzine W.I.N.D.

source: 44 Training Program
hr: 44 PROGRAM VJEŽBANJA

source: ENGLISH 9. TESTS
hr: HRVATSKI, SRPSKI

source: Polar Fitness Test TM
hr: 9. TESTOVI Polar Fitness Test TM

source: The Polar Fitness Test TM is an easy, safe, and quick way to measure your aerobic (cardiovascular) fitness at rest.
hr: Polar Fitness Test TM je lak, siguran i brz način za mjerenje vaših aerobnih (kardiovaskularnih) sposobnosti u mirovanju.

source: The result, Polar OwnIndex, is comparable to maximal oxygen uptake (VO2max), which is commonly used to evaluate aerobic fitness.
hr: Rezultat, Polar OwnIndex, je usporediv s maksimalnim unosom kisika (VO 2max), koji se obično koristi za ocjenu aerobnih sposobnosti.

source: Your long-term level of physical activity, heart rate, heart rate variability at rest, gender, age, height, and body weight all influence OwnIndex.
hr: Vaša dugoročna fizička aktivnost, otkucaji srca, promjenjivost otkucaja srca u mirovanju, spol, starost, visina i masa utječu na OwnIndex.

source: The Polar Fitness Test is developed for use by healthy adults.
hr: Polar Fitness Test je razvijen da ga koriste zdrave odrasle osobe.

source: Aerobic fitness relates to how well your cardiovascular system works to transport oxygen to your body.
hr: Aerobna sposobnost se odnosi na činjenicu koliko dobro vaš kardiovaskularni sustav radi za prijenos kisika u vaše tijelo.

source: The better your aerobic fitness, the stronger and more efficient your heart is.
hr: Što imate više aerobne sposobnosti, to je vaše srce jače i efikasnije.

source: Good aerobic fitness has many health benefits.
hr: Dobre aerobne sposobnosti imaju mnoge zdravstvene prednosti.

source: For example, it helps in decreasing high blood pressure and your risk of cardiovascular diseases and stroke.
hr: Na primjer, pomažu u smanjenju visokog krvnog tlaka i rizika od kardiovaskularnih bolesti i srčanog udara.

source: If you want to improve your aerobic fitness it takes, on average, six weeks of regular training to see a noticeable change in your OwnIndex.
hr: Ako želite poboljšati vaše aerobne sposobnosti, u prosjeku treba šest tjedana redovitog vježbanja kako bi vidjeli značajnu promjenu vašeg OwnIndexa.

source: Less fit individuals see progress even more rapidly.
hr: Manje sposobni pojedinci će brže uočiti promjene.

source: The better your aerobic fitness, the smaller the improvements in your OwnIndex. Aerobic fitness is best improved by exercise types that use large muscle groups.
hr: Što su vaše aerobne sposobnosti veće, to će promjene vašeg OwnIndexa biti manje Aerobne sposobnosti se najbolje poboljšavaju vrstama vježbi koje koriste velike grupe mišića.

source: Such activities include running, cycling, walking, rowing, swimming, skating, and cross-country skiing.
hr: Takve aktivnosti uključuju trčanje, vožnju bicikla, hodanje, veslanje, plivanje, klizanje i skijaško trčanje.

source: To monitor your progress, start by measuring your OwnIndex a couple of times during the first two weeks in order to get a baseline value, and then repeat the test approximately once a month.
hr: Kako bi nadgledali vaš napredak, počnite s mjerenjem vašeg OwnIndexa nekoliko puta tijekom prva dva tjedna kako bi dobili početnu vrijednost, i nakon toga test ponovite otprilike jednom mjesečno.
